import time
from collections import Counter
from assistant import scrabble_assistant as sa
# from preprocessing.dictionary import prepare_frequency_dictionaries


if __name__ == '__main__':

    # test_board = [
    #     [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', ' ', ' ', ' ', ' ', 'м', ' ', 'т', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', ' ', ' ', ' ', ' ', 'е', ' ', 'о', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', 'п', 'о', 'с', 'е', 'л', 'о', 'к', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', 'а', ' ', 'а', ' ', ' ', ' ', ' ', ' ', 'р', ' ', ' ', ' '],
    #     [' ', ' ', ' ', 'п', ' ', 'д', 'о', 'м', ' ', 'я', ' ', 'е', ' ', ' ', ' '],
    #     [' ', ' ', ' ', 'а', ' ', ' ', ' ', 'а', 'з', 'б', 'у', 'к', 'а', ' ', ' '],
    #     [' ', ' ', ' ', ' ', ' ', 'с', 'о', 'м', ' ', 'л', ' ', 'а', ' ', ' ', ' '],
    #     [' ', ' ', ' ', 'я', 'м', 'а', ' ', 'а', ' ', 'о', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', ' ', ' ', 'л', ' ', ' ', ' ', 'к', 'и', 'т', ' ', ' ', ' '],
    #     [' ', ' ', ' ', ' ', 'с', 'о', 'л', 'ь', ' ', 'о', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    #     [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    # ]

    test_board = [
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
        [' ', 'л', ' ', ' ', 'л', ' ', 'р', ' ', 'к', ' ', 'а', ' ', ' ', ' ', ' '],
        [' ', 'а', ' ', ' ', 'а', ' ', 'а', ' ', 'с', ' ', 'в', ' ', ' ', ' ', ' '],
    ]

    # # убираем пробелы, они нужны были только для удобства ввода
    for test_row in test_board:
        for test_j in range(len(test_row)):
            if test_row[test_j] == ' ':
                test_row[test_j] = ''

    t = time.time()
    test_hints, test_values = sa.get_n_hints(test_board, Counter('шрлтнто'), 10)
    print('Time = ' + str(time.time() - t) + 's')

    for hint_i in range(len(test_hints)):
        # доска с подсказкой
        hint = []
        for test_i in range(len(test_hints[hint_i])):
            hint.append([])
            for test_j in range(len(test_hints[hint_i][test_i])):
                if test_board[test_i][test_j] != '':
                    hint[test_i].append(test_board[test_i][test_j])
                else:
                    if test_hints[hint_i][test_i][test_j] == '':
                        hint[test_i].append(' ')
                    else:
                        hint[test_i].append(test_hints[hint_i][test_i][test_j].upper())
    print('Ценность подсказок: ' + str(test_values))

    # prepare_frequency_dictionaries('resources/dictionaries/nouns.txt')
